// Basic operations
/*
1.1. Створити числовий масив та проініціалізувати його 5-7 довільними числами.
1.2. Вивести в консоль, а потім видалити з масиву перший та останній елементи
       (програма має вивести: "Видалено перший: X, Видалено останній: Y").
1.3. Ввести і додати нове число на початок масиву та ще одне число в кінець масиву.
1.4. Зробити копії масиву:
     - повну копію всього масиву кількома способами;
     - копію елементів з 0-го по 3-й індекс (включно).
*/
const nums = [1, 2, 7, -9, 8];
console.log(nums);
console.log(`Видалено перший елемент: ${nums.shift()}`);
console.log(`Видалено останный елемент: ${nums.pop()}`);

nums.unshift(+prompt("Input first num"));
nums.push(+prompt("Input last num"));
